---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationCustomDataType
source: html/f83b689c-c6df-0776-669e-b77793e74a1b.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationCustomDataType

An enumerated type listing all fabrication custom data value types.

## Syntax (C#)
```csharp
public enum FabricationCustomDataType
```